assignments/A01.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-17 Thu 23:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Assignment 01</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Assignment 01
<br />
<span class="subtitle">Logic Gates in MyHDL</span>
</h1>

<div id="outline-container-orgd3f70db" class="outline-2">
<h2 id="orgd3f70db">Assignment</h2>
<div class="outline-text-2" id="text-orgd3f70db">
<p>
Using only <code>Nand</code>, <code>0</code>, and <code>1</code>, create MyHDL code for the following 16 functions (see also Figure 1.2 in <a href="https://docs.wixstatic.com/ugd/44046b_f2c9e41f0b204a34ab78be0ae4953128.pdf">Ch1</a>).  Submissions are due 1 week after A01 appears in the autograder.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">x</th>
<th scope="col" class="org-left">0 0 1 1</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">y</th>
<th scope="col" class="org-left">0 1 0 1</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">constant 0</td>
<td class="org-left">0</td>
<td class="org-left">0 0 0 0</td>
</tr>

<tr>
<td class="org-left">And</td>
<td class="org-left">x and y</td>
<td class="org-left">0 0 0 1</td>
</tr>

<tr>
<td class="org-left">x And Not y</td>
<td class="org-left">x and (not y)</td>
<td class="org-left">0 0 1 0</td>
</tr>

<tr>
<td class="org-left">x</td>
<td class="org-left">x</td>
<td class="org-left">0 0 1 1</td>
</tr>

<tr>
<td class="org-left">Not x And y</td>
<td class="org-left">not (x and y)</td>
<td class="org-left">0 1 0 0</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">y</td>
<td class="org-left">0 1 0 1</td>
</tr>

<tr>
<td class="org-left">Xor</td>
<td class="org-left">(x and (not y)) or (not (x and y))</td>
<td class="org-left">0 1 1 0</td>
</tr>

<tr>
<td class="org-left">Or</td>
<td class="org-left">x or y</td>
<td class="org-left">0 1 1 1</td>
</tr>

<tr>
<td class="org-left">Nor</td>
<td class="org-left">not (x or y)</td>
<td class="org-left">1 0 0 0</td>
</tr>

<tr>
<td class="org-left">Equivalence</td>
<td class="org-left">x is y</td>
<td class="org-left">1 0 0 1</td>
</tr>

<tr>
<td class="org-left">Not y</td>
<td class="org-left">not y</td>
<td class="org-left">1 0 1 0</td>
</tr>

<tr>
<td class="org-left">If y then x</td>
<td class="org-left">x or (not y)</td>
<td class="org-left">1 0 1 1</td>
</tr>

<tr>
<td class="org-left">Not x</td>
<td class="org-left">not x</td>
<td class="org-left">1 1 0 0</td>
</tr>

<tr>
<td class="org-left">If x then y</td>
<td class="org-left">(not x) or y</td>
<td class="org-left">1 1 0 1</td>
</tr>

<tr>
<td class="org-left">Nand</td>
<td class="org-left">not (x and y)</td>
<td class="org-left">1 1 1 0</td>
</tr>

<tr>
<td class="org-left">constant 1</td>
<td class="org-left">1</td>
<td class="org-left">1 1 1 1</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgfb8e22e" class="outline-2">
<h2 id="orgfb8e22e">MyHDL boilerplate</h2>
<div class="outline-text-2" id="text-orgfb8e22e">
<p>
For each primitive gate, you can start with the following "boilerplate" code and add your implementation:
</p>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #373737;"># </span><span style="color: #373737;">common imports</span>
<span style="color: #490026; font-weight: bold;">from</span> myhdl <span style="color: #490026; font-weight: bold;">import</span> block, always_comb, Signal, instance, delay

<span style="color: #373737;"># </span><span style="color: #373737;">import any gates you've already built, if you need them</span>
<span style="color: #490026; font-weight: bold;">from</span> Nand <span style="color: #490026; font-weight: bold;">import</span> Nand


<span style="color: #373737;"># </span><span style="color: #373737;">implement the gate</span>
<span style="color: #014500;">@block</span>
<span style="color: #490026; font-weight: bold;">def</span> <span style="color: #340557; font-weight: bold;">Name_of_gate_to_implement</span>(a, b, z):
    <span style="color: #373737;"># </span><span style="color: #373737;">probably make some signals here, connect Nand (and other) gates together</span>

    <span style="color: #014500;">@always_comb</span>
    <span style="color: #490026; font-weight: bold;">def</span> <span style="color: #340557; font-weight: bold;">f</span>():
        z.<span style="color: #9e0045;">next</span> = ??? <span style="color: #373737;"># </span><span style="color: #373737;">replace ??? with this block's output</span>

    <span style="color: #490026; font-weight: bold;">return</span> f

<span style="color: #373737;"># </span><span style="color: #373737;">last, add the test harness, replacing And with the name of the function currently being implmented</span>
<span style="color: #373737;"># </span><span style="color: #373737;">the code at the bottom will be mostly identical for all of the tests</span>
<span style="color: #014500;">@block</span>
<span style="color: #490026; font-weight: bold;">def</span> <span style="color: #340557; font-weight: bold;">test_gate</span>(func):
    <span style="color: #014500;">a</span>, <span style="color: #014500;">b</span>, <span style="color: #014500;">z</span> = [Signal(<span style="color: #374014;">0</span>) <span style="color: #490026; font-weight: bold;">for</span> _ <span style="color: #490026; font-weight: bold;">in</span> <span style="color: #9e0045;">range</span>(<span style="color: #374014;">3</span>)]
    <span style="color: #014500;">impl1</span> = func(a, b, z)  <span style="color: #373737;"># </span><span style="color: #373737;">assumes you follow the same convention of a, b, z for input_a, input_b, output</span>

    <span style="color: #014500;">@instance</span>
    <span style="color: #490026; font-weight: bold;">def</span> <span style="color: #340557; font-weight: bold;">tester</span>():
        <span style="color: #490026; font-weight: bold;">print</span>(<span style="color: #0f126e;">"a b z"</span>)
        <span style="color: #490026; font-weight: bold;">for</span> i <span style="color: #490026; font-weight: bold;">in</span> [<span style="color: #374014;">0</span>, <span style="color: #374014;">1</span>]:
            <span style="color: #490026; font-weight: bold;">for</span> j <span style="color: #490026; font-weight: bold;">in</span> [<span style="color: #374014;">0</span>, <span style="color: #374014;">1</span>]:
                a.<span style="color: #9e0045;">next</span>, b.<span style="color: #9e0045;">next</span> = i, j
                <span style="color: #490026; font-weight: bold;">yield</span> delay(<span style="color: #374014;">1</span>)
                <span style="color: #490026; font-weight: bold;">print</span>(a, b, <span style="color: #9e0045;">int</span>(z))

    <span style="color: #490026; font-weight: bold;">return</span> impl1, tester

<span style="color: #490026; font-weight: bold;">if</span> <span style="color: #9e0045;">__name__</span> == <span style="color: #0f126e;">"__main__"</span>:
    <span style="color: #014500;">test</span> = test_gate(And)  <span style="color: #373737;"># </span><span style="color: #373737;">replace And with the name of your function</span>
    test.run_sim()

</pre>
</div>
</div>
</div>

<div id="outline-container-orgedc80bb" class="outline-2">
<h2 id="orgedc80bb">Provided gate: Nand</h2>
<div class="outline-text-2" id="text-orgedc80bb">
<p>
Below is the implementation of <code>Nand</code>.  Remember that this one is allowed to use Python's <code>and</code> and <code>not</code> keywords.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #373737;"># </span><span style="color: #373737;">filename: Nand.py</span>
<span style="color: #490026; font-weight: bold;">from</span> myhdl <span style="color: #490026; font-weight: bold;">import</span> block, always_comb

<span style="color: #014500;">@block</span>
<span style="color: #490026; font-weight: bold;">def</span> <span style="color: #340557; font-weight: bold;">Nand</span>(a, b, out):
    <span style="color: #014500;">@always_comb</span>
    <span style="color: #490026; font-weight: bold;">def</span> <span style="color: #340557; font-weight: bold;">f</span>():
        out.<span style="color: #9e0045;">next</span> = <span style="color: #490026; font-weight: bold;">not</span> (a <span style="color: #490026; font-weight: bold;">and</span> b)
    <span style="color: #490026; font-weight: bold;">return</span> f
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b09f0e" class="outline-2">
<h2 id="org0b09f0e">Provided gate: Not</h2>
<div class="outline-text-2" id="text-org0b09f0e">
<p>
Below is an implementation of <code>Not</code>, using <code>Nand</code> as its building block.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #373737;"># </span><span style="color: #373737;">filename: Not.py</span>
<span style="color: #490026; font-weight: bold;">from</span> myhdl <span style="color: #490026; font-weight: bold;">import</span> block, always_comb, Signal
<span style="color: #490026; font-weight: bold;">from</span> Nand <span style="color: #490026; font-weight: bold;">import</span> Nand

<span style="color: #014500;">@block</span>
<span style="color: #490026; font-weight: bold;">def</span> <span style="color: #340557; font-weight: bold;">Not</span>(a, z):
    <span style="color: #014500;">out</span> = Signal(<span style="color: #374014;">0</span>)
    <span style="color: #014500;">n1</span> = Nand(a, <span style="color: #374014;">1</span>, out)

    <span style="color: #014500;">@always_comb</span>
    <span style="color: #490026; font-weight: bold;">def</span> <span style="color: #340557; font-weight: bold;">f</span>():
        z.<span style="color: #9e0045;">next</span> = out

    <span style="color: #490026; font-weight: bold;">return</span> f, n1
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfaca6fc" class="outline-2">
<h2 id="orgfaca6fc">Provided gate: Or</h2>
<div class="outline-text-2" id="text-orgfaca6fc">
<p>
As a final example, the <code>Or</code> gate can be implmented using any of the gates already described (<code>Nand</code> and <code>Not</code>).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #373737;"># </span><span style="color: #373737;">filename: Or.py</span>
<span style="color: #490026; font-weight: bold;">from</span> myhdl <span style="color: #490026; font-weight: bold;">import</span> block, always_comb, Signal, intbv

<span style="color: #490026; font-weight: bold;">from</span> Nand <span style="color: #490026; font-weight: bold;">import</span> Nand
<span style="color: #490026; font-weight: bold;">from</span> Not <span style="color: #490026; font-weight: bold;">import</span> Not

<span style="color: #014500;">@block</span>
<span style="color: #490026; font-weight: bold;">def</span> <span style="color: #340557; font-weight: bold;">Or</span>(a, b, z):
    <span style="color: #014500;">nota</span> = Signal(<span style="color: #374014;">0</span>)
    <span style="color: #014500;">notb</span> = Signal(<span style="color: #374014;">0</span>)
    <span style="color: #014500;">out</span> = Signal(<span style="color: #374014;">0</span>)

    <span style="color: #014500;">n1</span> = Not(a, nota)
    <span style="color: #014500;">n2</span> = Not(b, notb)
    <span style="color: #014500;">n3</span> = Nand(nota, notb, out)

    <span style="color: #014500;">@always_comb</span>
    <span style="color: #490026; font-weight: bold;">def</span> <span style="color: #340557; font-weight: bold;">f</span>():
        z.<span style="color: #9e0045;">next</span> = out

    <span style="color: #490026; font-weight: bold;">return</span> f, n1, n2, n3
</pre>
</div>
</div>
</div>
<div id="outline-container-org1938135" class="outline-2">
<h2 id="org1938135">Test harness</h2>
<div class="outline-text-2" id="text-org1938135">
<p>
You can use the following test harness for all of the 2-input gates.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #490026; font-weight: bold;">from</span> myhdl <span style="color: #490026; font-weight: bold;">import</span> block, instance, delay, Signal

<span style="color: #373737;"># </span><span style="color: #373737;">two-input gate test harness</span>
<span style="color: #014500;">@block</span>
<span style="color: #490026; font-weight: bold;">def</span> <span style="color: #340557; font-weight: bold;">test_two</span>(func):
    <span style="color: #014500;">a</span>, <span style="color: #014500;">b</span>, <span style="color: #014500;">z</span> = [Signal(<span style="color: #374014;">0</span>) <span style="color: #490026; font-weight: bold;">for</span> _ <span style="color: #490026; font-weight: bold;">in</span> <span style="color: #9e0045;">range</span>(<span style="color: #374014;">3</span>)]
    <span style="color: #014500;">fun1</span> = func(a, b, z)

    <span style="color: #014500;">@instance</span>
    <span style="color: #490026; font-weight: bold;">def</span> <span style="color: #340557; font-weight: bold;">tester</span>():
        <span style="color: #490026; font-weight: bold;">print</span>(<span style="color: #0f126e;">"a b z"</span>)
        <span style="color: #490026; font-weight: bold;">for</span> i <span style="color: #490026; font-weight: bold;">in</span> [<span style="color: #374014;">0</span>, <span style="color: #374014;">1</span>]:
            <span style="color: #490026; font-weight: bold;">for</span> j <span style="color: #490026; font-weight: bold;">in</span> [<span style="color: #374014;">0</span>, <span style="color: #374014;">1</span>]:
                a.<span style="color: #9e0045;">next</span>, b.<span style="color: #9e0045;">next</span> = i, j
                <span style="color: #490026; font-weight: bold;">yield</span> delay(<span style="color: #374014;">1</span>)
                <span style="color: #490026; font-weight: bold;">print</span>(a, b, <span style="color: #9e0045;">int</span>(z))

    <span style="color: #490026; font-weight: bold;">return</span> fun1, tester


<span style="color: #373737;"># </span><span style="color: #373737;">one-input gate test harness</span>
<span style="color: #014500;">@block</span>
<span style="color: #490026; font-weight: bold;">def</span> <span style="color: #340557; font-weight: bold;">test_one</span>(func):
    <span style="color: #014500;">a</span>, <span style="color: #014500;">z</span> = [Signal(<span style="color: #374014;">0</span>) <span style="color: #490026; font-weight: bold;">for</span> _ <span style="color: #490026; font-weight: bold;">in</span> <span style="color: #9e0045;">range</span>(<span style="color: #374014;">2</span>)]
    <span style="color: #014500;">fun1</span> = func(a, z)

    <span style="color: #014500;">@instance</span>
    <span style="color: #490026; font-weight: bold;">def</span> <span style="color: #340557; font-weight: bold;">tester</span>():
        <span style="color: #490026; font-weight: bold;">print</span>(<span style="color: #0f126e;">"a z"</span>)
        <span style="color: #490026; font-weight: bold;">for</span> i <span style="color: #490026; font-weight: bold;">in</span> [<span style="color: #374014;">0</span>, <span style="color: #374014;">1</span>]:
            a.<span style="color: #9e0045;">next</span> = i
            <span style="color: #490026; font-weight: bold;">yield</span> delay(<span style="color: #374014;">1</span>)
            <span style="color: #490026; font-weight: bold;">print</span>(a, <span style="color: #9e0045;">int</span>(z))

    <span style="color: #490026; font-weight: bold;">return</span> fun1, tester
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb9c0254" class="outline-2">
<h2 id="orgb9c0254">Comlete example: Or</h2>
<div class="outline-text-2" id="text-orgb9c0254">
<p>
A complete example like you would turn in for <code>Or</code> is shown below:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #373737;"># </span><span style="color: #373737;">save this file as Or.py</span>
<span style="color: #490026; font-weight: bold;">from</span> myhdl <span style="color: #490026; font-weight: bold;">import</span> block, always_comb, Signal
<span style="color: #490026; font-weight: bold;">from</span> Nand <span style="color: #490026; font-weight: bold;">import</span> Nand
<span style="color: #490026; font-weight: bold;">from</span> Not <span style="color: #490026; font-weight: bold;">import</span> Not
<span style="color: #490026; font-weight: bold;">from</span> Test <span style="color: #490026; font-weight: bold;">import</span> test_two

<span style="color: #014500;">@block</span>
<span style="color: #490026; font-weight: bold;">def</span> <span style="color: #340557; font-weight: bold;">Or</span>(a, b, z):
    <span style="color: #014500;">nota</span> = Signal(<span style="color: #374014;">0</span>)
    <span style="color: #014500;">notb</span> = Signal(<span style="color: #374014;">0</span>)
    <span style="color: #014500;">out</span> = Signal(<span style="color: #374014;">0</span>)

    <span style="color: #014500;">n1</span> = Not(a, nota)
    <span style="color: #014500;">n2</span> = Not(b, notb)
    <span style="color: #014500;">n3</span> = Nand(nota, notb, out)

    <span style="color: #014500;">@always_comb</span>
    <span style="color: #490026; font-weight: bold;">def</span> <span style="color: #340557; font-weight: bold;">f</span>():
        z.<span style="color: #9e0045;">next</span> = out

    <span style="color: #490026; font-weight: bold;">return</span> f, n1, n2, n3


<span style="color: #490026; font-weight: bold;">if</span> <span style="color: #9e0045;">__name__</span> == <span style="color: #0f126e;">"__main__"</span>:
    <span style="color: #014500;">test</span> = test_two(Or)
    test.run_sim()
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
